Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/K45B.tmx
Source language: en_us
Languages: zh_cn

source: The WONDER CLOCK
zh_cn: 奇妙的大钟

source: I PUT on my dream-cap one day and stepped into Wonderland.
zh_cn: 有一天，我戴上美梦帽，走进奇妙国。

source: Along the road I jogged and never dusted my shoes, and all the time the pleasant sun shone and never burned my back, and the little white clouds floated across the blue sky and never let fall a drop of rain to wet my jacket.
zh_cn: 一路蹦蹦跳跳，鞋子不沾半点尘土；阳光宜人，后背没有晒得发烫；小朵小朵白白的云飘过蓝蓝的天，没有雨点落下打湿衣裳。

source: And by and by I came to a steep hill.
zh_cn: 不一会儿，我来到一座险峻的山脚。

source: I climbed the hill, though I had more than one tumble in doing it, and there, on the tip-top, I found a house as old as the world itself.
zh_cn: 往山上爬啊爬，一路摔了无数个跟头。站在山顶，我看见一座岁数跟世界一样古老的房子。

source: That was where Father Time lived; and who should sit in the sun at the door, spinning away for dear life, but Time's Grandmother herself; and if you would like to know how old she is you will have to climb to the top of the church steeple and ask the wind as he sits upon the weather-cock, humming the tune of Over-yonder song to himself.
zh_cn: 那是时间爸爸居住的地方。坐在大门口太阳底下，为美好的生活使劲纺线的，不正是时间奶奶吗？你要想知道她多大年纪，必须爬到教堂的尖顶问风儿，风儿坐在风向标上，哼唱《在那遥远的地方》。

source: "Good-morning," says Time's Grandmother to me.
zh_cn: “早上好。”时间奶奶开口对我说。

source: "Good-morning," says I to her.
zh_cn: “早上好。”我回答。

source: "And what do you seek here?" says she to me.
zh_cn: “你来找什么？”她问。

source: "I come to look for odds and ends," says I to her.
zh_cn: “来拾零碎儿。”我说。

source: "Very well," says she; "just climb the stairs to the garret, and there you will find more than ten men can think about."
zh_cn: “好极了。”她说道。“爬上梯子去阁楼，那儿你能找到不计其数的零碎东西。”

source: "Thank you," says I, and up the stairs I went. There I found all manner of queer forgotten things which had been laid away, nobody but Time and his Grandmother could tell where.
zh_cn: “谢谢您。”我说。登上楼梯，我发现千奇百怪的被人们收起来又遗忘的东西。只有时间母子说得出它们的来源。

source: Over in the corner was a great, tall clock, that had stood there silently with never a tick or a ting since men began to grow too wise for toys and trinkets.
zh_cn: 远远的角落里，默默矗立一座高大的时钟。自从长大了的人们聪明得对小玩意儿不再感兴趣后，它便闷声不响。

source: But I knew very well that the old clock was the Wonder Clock; so down I took the key and wound it -- gurr! gurr! gurr!
zh_cn: 可是我知道，这个老钟是“奇妙的大钟”。我弯腰捡起钥匙，转动发条，咔咔咔！

source: Click! buzz! went the wheels, and then -- tick-tock! tick-tock!
zh_cn: 咔嗒！嗡——齿轮启动，指针滴答滴答走起来。

source: for the Wonder Clock is of that kind that it will never wear out, no matter how long it may stand in Time's garret.
zh_cn: 无论在时间的阁楼放多久，奇妙的大钟都不会损坏。

source: Down I sat and watched it, for every time it struck it played a pretty song, and when the song was ended -- click! click! -- out stepped the drollest little puppet-figures and went through with a dance, and I saw it all (with my dream-cap upon my head).
zh_cn: 我一屁股坐下，盯着钟。每打一个整点，钟里播放一首好听的歌儿，歌由结束，滴答滴答走出来一群顶滑稽的小木偶，匆匆跳一支舞。我看得如痴如醉，美梦帽歪戴在头上。
